In [1]:
# Import libaries 
import pandas as pd
import os

In [11]:
os.listdir("data")
df = pd.ExcelFile("data/AGO STOCK MOVEMENT 2015.xlsx")
print(df.sheet_names)
jan=pd.read_excel(df, "JANUARY 2015", skiprows=5)
jan=jan[["DATE", "SALES"]]
jan=jan.iloc[0:32,:]
jan.tail()

['JANUARY 2015', 'FEBRUARY 2015', 'MARCH 2015', 'APRIL 2015', 'MAY 2015', 'JUNE 2015', 'JULY 2015', 'AUGUST 2015', 'SEPTEMBER 2015']

         DATE    SALES
27 2015-01-27  6870.83
28 2015-01-28  6042.06
29 2015-01-29  5947.24
30 2015-01-30  6324.38
31 2015-01-31  4880.65

In [16]:
feb=pd.read_excel(df, "FEBRUARY 2015", skiprows=5)
feb=feb[["DATE", "SALES"]]
feb=feb.iloc[0:29,:]
feb.head()

        DATE    SALES
0        NaT      NaN
1 2015-02-01  3843.45
2 2015-02-02  6123.17
3 2015-02-03  6230.18
4 2015-02-04  6190.34

In [17]:
final=pd.concat([jan, feb])
final.shape

(61, 2)

In [19]:
final["date"]=pd.DatetimeIndex(final["DATE"])
final.head()

        DATE    SALES       date
0        NaT      NaN        NaT
1 2015-01-01  3171.43 2015-01-01
2 2015-01-02  3843.45 2015-01-02
3 2015-01-03  3556.74 2015-01-03
4 2015-01-04  3482.36 2015-01-04

In [29]:
final.info()
final=final.dropna()
final["date"].unique()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 59 entries, 1 to 28
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DATE    59 non-null     datetime64[ns]
 1   SALES   59 non-null     float64
 2   date    59 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1)
memory usage: 1.8 KB

array(['2015-01-01T00:00:00.000000000', '2015-01-02T00:00:00.000000000',
       '2015-01-03T00:00:00.000000000', '2015-01-04T00:00:00.000000000',
       '2015-01-05T00:00:00.000000000', '2015-01-06T00:00:00.000000000',
       '2015-01-07T00:00:00.000000000', '2015-01-08T00:00:00.000000000',
       '2015-01-09T00:00:00.000000000', '2015-01-10T00:00:00.000000000',
       '2015-01-11T00:00:00.000000000', '2015-01-12T00:00:00.000000000',
       '2015-01-13T00:00:00.000000000', '2015-01-14T00:00:00.000000000',
       '2015-01-15T00:00:00.000000000', '2015-01-16T00:00:00.000000000',
       '2015-01-17T00:00:00.000000000', '2015-01-18T00:00:00.000000000',
       '2015-01-19T00:00:00.000000000', '2015-01-20T00:00:00.000000000',
       '2015-01-21T00:00:00.000000000', '2015-01-22T00:00:00.000000000',
       '2015-01-23T00:00:00.000000000', '2015-01-24T00:00:00.000000000',
       '2015-01-25T00:00:00.000000000', '2015-01-26T00:00:00.000000000',
       '2015-01-27T00:00:00.000000000', '2015-01-28T00:00:00.000000000',
       '2015-01-29T00:00:00.000000000', '2015-01-30T00:00:00.000000000',
       '2015-01-31T00:00:00.000000000', '2015-02-01T00:00:00.000000000',
       '2015-02-02T00:00:00.000000000', '2015-02-03T00:00:00.000000000',
       '2015-02-04T00:00:00.000000000', '2015-02-05T00:00:00.000000000',
       '2015-02-06T00:00:00.000000000', '2015-02-07T00:00:00.000000000',
       '2015-02-08T00:00:00.000000000', '2015-02-09T00:00:00.000000000',
       '2015-02-10T00:00:00.000000000', '2015-02-11T00:00:00.000000000',
       '2015-02-12T00:00:00.000000000', '2015-02-13T00:00:00.000000000',
       '2015-02-14T00:00:00.000000000', '2015-02-15T00:00:00.000000000',
       '2015-02-16T00:00:00.000000000', '2015-02-17T00:00:00.000000000',
       '2015-02-18T00:00:00.000000000', '2015-02-19T00:00:00.000000000',
       '2015-02-20T00:00:00.000000000', '2015-02-21T00:00:00.000000000',
       '2015-02-22T00:00:00.000000000', '2015-02-23T00:00:00.000000000',
       '2015-02-24T00:00:00.000000000', '2015-02-25T00:00:00.000000000',
       '2015-02-26T00:00:00.000000000', '2015-02-27T00:00:00.000000000',
       '2015-02-28T00:00:00.000000000'], dtype='datetime64[ns]')

In [1]:
import plotly_express as px
px.line(final, x= "date", y="SALES")

NameError: name 'final' is not defined

In [ ]:
# Import necessary libraries
import pandas as pd
import os

# Define file path and sheet names
file_path = "data/AGO STOCK MOVEMENT 2015.xlsx"
sheet_names = ["JANUARY 2015", "FEBRUARY 2015", "MARCH 2015"]  # Add additional sheet names as needed

# Loop through sheets and clean data
for sheet_name in sheet_names:
    # Read in data from sheet
    df = pd.read_excel(file_path, sheet_name, skiprows=5)
    
    # Select relevant columns and rows
    df = df[["DATE", "SALES"]].iloc[0:32,:]
    
    # Print cleaned data
    print(f"Cleaned data for {sheet_name}:")
    print(df.tail())

In [ ]:
pd = df